/*
1. Написати функцію з одним аргументом, яка перевіряє чи є аргумент числом.
 Якщо так, то повертає чи є це цисло парним чи не парним. Якщо аргумент не число - повертає пусту строку.
*/ 
var number1;
number1=33;
function proverka(number1)
{
    if(number1 % 2 === 0 )
    {
       alert('Число парне' + number1);

    }
    if( number1 % 2 !== 0)
    {
        alert('Число непарне ' + number1);
    }
     
    else {
        alert( '');
    }
}

proverka(number1);

/*2. Написати функцію, яка починає перебирати числа від 1 до нескінченності і перевіряє чи є число простим 
(просте число - те яке ділиться лише на 1 чи само на себе).
Якщо просто число знайдене - воно додається до масиву.
 Після пʼятого знайденого простого числа функція повинна повернути суму всіх пʼяти простих чисел в масиві. */

function n(num) {
    for (var i = 2, max = Math.sqrt(num); i <= max; i++) 
    //из числа всего будет половина подходящих чисел 
    {
      if (num % i === 0) {
        return false;
      }    
    }
    return num > 1;
  }

  var sumy=0;
  var a=0;

  function v(num) {
   var prim = [];
    
    for (var  i = 2; i <= num; i++) {
       
       if(a<5) {
      if (n(i)) {
        prim.push(i);
        a++;  
        sumy +=i;
      }
    }
    else{
        break;
    }
    }
    alert('Сумма чисел ' +sumy);
    return prim;
  }
  
  console.log(v(20));
 /* 
 3. Написати функцію з одним аргументом n, що є числом. 
 Функція повинна повернути суму наступного ряду з n чисел 1 + 11 + 111 + 1111 + ...., 
 де кожний елемент - число з постійно зростаючою кількістю одиниць.
Наприклад:
Ви передаєте в функцію фргумент 5.
Функція рахує сумму для ряду виду: 1 + 11 + 111 + 1111 + 11111.
В даному прикладі вона повинна повернути число 12345
 */


 var tr = prompt('Введи любое число' )
 

function one (tr)
{
    let q=1;
    var c="1";
  for(var o=1;o<tr;o++)
  {

c=c+1;
let ch=Number(c);
q=q+ch;
  }
  alert(c);
  alert(q);
  return c;
}
one(tr);
